app/Controllers/Alunos.php

    public function lista_alunos()
    {
        echo view('include_files/header');
        echo view('include_files/nav');
		return view('alunos/lista_alunos', [
			'alunos' => $this->alunosModel->paginate(10),
			'pager' => $this->alunosModel->pager
		]);
---
SELECT *
FROM `alunos`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `alunos`